Repository: common-repository/amnl-ideal-using-mollie
Catalog: i18n/amnl_mollie_ideal-*.po
Languages: nl_nl

source: Enable/Disable
nl_nl: In-/uitschakelen

source: Enable iDEAL
nl_nl: iDEAL inschakelen

source: Your personal Partner ID / Customer ID.
nl_nl: Je persoonlijke Partner ID / klant ID.

source: Profile Key
nl_nl: Profiel Key

source: Optional Mollie payment-profile key.
nl_nl: Optionele Mollie betaalprofiel key.

source: Test Mode
nl_nl: Test Modus

source: Enable testmode
nl_nl: Testmodus activeren

source: Title
nl_nl: Titel

source: This controls the title which the user sees during checkout.
nl_nl: Hier mee bepaalt u welke titel de eindgebruiker ziet bij het afrekenen.

source: Description
nl_nl: Omschrijving

source: Give the customer instructions about paying with iDEAL and the additional terms.
nl_nl: Geef instructies aan uw klant betreffende het betalen via iDEAL en de bijbehorende voorwaarden.

source: With iDEAL you can easily pay online in the secure environment of your own bank.
nl_nl: Met iDeal betaalt u eenvoudig online via de vertrouwde omgeving van uw eigen bank.

source: Transaction Description
nl_nl: Transactie omschrijving

source: This will be shown on the bank statement of the customer. Add <code>%%order</code> where you wish to display the order number.
nl_nl: Dit zal zichtbaar zijn op het bankafschrift van de klant. Voeg <code>%%order</code> in op de plaats waar u het ordernummer wilt tonen.

source: Accept iDEAL payments using Mollie's service.
nl_nl: Accepteer iDEAL betalingen via de diensten van Mollie.

source: Gateway Disabled
nl_nl: Betalingsmethode Uitgeschakeld

source: Mollie does not support your store currency.
nl_nl: Mollie ondersteunt de valuta die gebruikt wordt in uw winkel niet.

source: Could not create payment.
nl_nl: Kon geen betaling aanmaken.

source: Awaiting iDEAL payment and authorization
nl_nl: Wachten op betaling via iDEAL

source: We are experiencing some difficulties whilst contacting the payment service provider. Please try again in a moment.
nl_nl: Op dit moment ervaren we wat technische problemen bij onze verzoeken aan de betalingsprovider. Probeert u het zometeen nogmaals, alstublieft.

source: Choose your bank
nl_nl: Kies uw bank

source: You must select your bank to use the iDEAL payment option.
nl_nl: U dient uw bank te selecteren om gebruik te maken van iDEAL.

source: Invalid Bank for iDEAL payment supplied.
nl_nl: Ongeldige Bank gekozen voor iDEAL.

source: Your payment is currently being processed.
nl_nl: Uw betaling wordt momenteel verwerkt.

source: Check transaction
nl_nl: Controleer betaling

source: Request a status update from Mollie
nl_nl: Vraag de actuele status op bij Mollie

source: Bank Account:
nl_nl: Rekeningnummer:

source: Holder:
nl_nl: Op naam van:

source: iDEAL payment has been cancelled.
nl_nl: iDEAL betaling is geannuleerd.

source: iDEAL payment failed.
nl_nl: iDEAL transactie is mislukt.

source: iDEAL payment expired.
nl_nl: iDEAL transactie is verlopen.
